# https://github.com/Homebrew/homebrew-bundle

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "puma/puma"
tap "teamookla/speedtest"
tap "universal-ctags/universal-ctags"

# Homebrew
# https://github.com/Homebrew/brew/

# Need to install openssl before libyaml
brew "openssl"

# Base packages
brew "coreutils"
brew "moreutils"
brew "findutils"
brew "wget"
brew "zsh"
brew "curl"
brew "cmake"

# Development stuff
brew "watch"
brew "ccache"
brew "git"
brew "git-extras"
brew "git-lfs"
brew "git-filter-repo"
brew "jq"         # reading json
brew "jo"         # creating json
brew "pipx"
brew "shellcheck"
brew "shfmt"
brew "svn"
brew "subversion"
brew "the_silver_searcher"
brew "universal-ctags"
brew "yq"
brew "lua"
brew "stylua"
brew "exiftool"

cask "gitify"
cask "meld"
cask "iterm2"
brew "luajit", args: ['HEAD']
brew "neovim", args: ['HEAD']

cask "adoptopenjdk"
brew "maven"

brew "ruby"
brew "node"

# Virtual environments
brew "rbenv"

# Virtualization
cask "docker"
cask "virtualbox"
brew "ctop"       # awesome htop for containers
brew "hadolint"

# Browsers
cask "brave-browser"
cask "google-chrome"
cask "firefox"

# Utilities
brew "aria2"
brew "gnupg"
brew "openssh"
brew "htop"
brew "screenfetch"
brew "parallel"
brew "nmap"

# fonts
tap "homebrew/cask-fonts"

cask "font-iosevka"
cask "font-fontawesome"
cask "font-material-icons"
cask "font-hack-nerd-font"
cask "font-awesome-terminal-fonts"

# aws
brew "awscli"
cask "aws-vault"
tap "salesforce/cloudsplaining", "https://github.com/salesforce/cloudsplaining"
brew "cloudsplaining"

# others
cask "spotify"
cask "signal"
cask "slack"
cask "authy"
