# https://github.com/Homebrew/homebrew-bundle

tap "homebrew/bundle"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "puma/puma"
tap "teamookla/speedtest"
tap "ankitpokhrel/jira-cli"
tap "jesseduffield/lazygit"

# Homebrew
# https://github.com/Homebrew/brew/

# Need to install openssl before libyaml
brew "openssl"

# Base packages
brew "coreutils"
brew "moreutils"
brew "findutils"
brew "wget"
brew "curl"
brew "cmake"
brew "gnu-sed"

# shell
brew "zsh"
brew "fish", args: ['HEAD']

# Development stuff
brew "watch"
brew "ccache"
brew "git"
brew "git-extras"
brew "git-lfs"
brew "git-filter-repo"
brew "git-delta"
brew "lazygit"
brew "jq"         # reading json
brew "jo"         # creating json
brew "pipx"
brew "pipenv"
brew "shellcheck"
brew "shfmt"
brew "svn"
brew "subversion"
brew "ripgrep"
brew "the_silver_searcher"
brew "ripgrep"
brew "universal-ctags"
brew "yq"
brew "lua"
brew "stylua"
brew "exiftool"
brew "rust"
brew "fnm"

cask "gitify"
cask "meld"
cask "iterm2"
cask "warp"
brew "neovim", args: ['HEAD']
cask "visual-studio-code"

brew "jenv"
cask "temurin"
cask "temurin8"
brew "maven"

brew "ruby"
brew "node"

# Virtual environments
brew "rbenv"

# Virtualization
cask "docker"
brew "ctop"       # awesome htop for containers
brew "hadolint"
brew "kind"
brew "helm"
cask "virtualbox"

# Browsers
cask "brave-browser"
cask "google-chrome"
cask "firefox"

# Utilities
brew "aria2"
brew "asdf"
brew "bat"
brew "direnv"
brew "eza"
brew "fd"
brew "fzf"
brew "glow"
brew "gnupg"
brew "htop"
brew "jira-cli"
brew "nmap"
brew "openssh"
brew "p7zip"
brew "parallel"
brew "prettyping"
brew "screenfetch"
brew "timg"
brew "viddy"
brew "zoxide"
cask "google-drive"

# fonts
tap "homebrew/cask-fonts"

cask "font-iosevka"
cask "font-fontawesome"
cask "font-material-icons"
cask "font-hack-nerd-font"
cask "font-awesome-terminal-fonts"

# cloud
tap "aws/tap"
tap "common-fate/granted"
tap "fugue/regula"
tap "hashicorp/tap"

brew "aws-sam-cli"
brew "awscli"
brew "aws-nuke"
brew "granted"
brew "hashicorp/tap/terraform"
brew "hashicorp/tap/terraform-ls"
brew "regula"

# others
cask "spotify"
cask "signal"
cask "slack"
cask "authy"
brew "mike-engel/jwt-cli/jwt-cli"
