# https://github.com/Homebrew/homebrew-bundle

tap "homebrew/bundle"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "homebrew/cask-fonts"
tap "aws/tap"
tap "common-fate/granted"
tap "fugue/regula"
tap "hashicorp/tap"
tap "ankitpokhrel/jira-cli"
tap "jesseduffield/lazygit"
tap "lucagrulla/tap"

# Base packages
brew "openssl"
brew "coreutils"
brew "moreutils"
brew "findutils"
brew "wget"
brew "curl"
brew "cmake"
brew "gnu-sed"

# Shell
brew "fish", args: ['HEAD']
brew "starship"
brew "zsh"

# Version managers
brew "asdf"
brew "pyenv"
brew "pyenv-virtualenv"

# Development - Git
brew "git"
brew "git-extras"
brew "git-lfs"
brew "git-filter-repo"
brew "git-delta"
brew "ggshield"
brew "lazygit"

# Development - Languages
brew "rust"
brew "ruby"
brew "node"
brew "lua"
brew "luarocks"
brew "maven"
brew "composer"

# Development - Tools
brew "watch"
brew "ccache"
brew "jq"
brew "jo"
brew "yq"
brew "shellcheck"
brew "shfmt"
brew "stylua"
brew "exiftool"
brew "watchman"
brew "cloc"
brew "markdownlint-cli"
brew "efm-langserver"
cask "meld"
brew "neovim", args: ['HEAD']
cask "visual-studio-code"

# Python tools
brew "pipx"
brew "uv"

# Java
cask "temurin"

# Virtualization & Containers
brew "ctop"
brew "hadolint"
brew "kind"
brew "helm"
cask "orbstack"

# Browsers
cask "brave-browser"
cask "google-chrome"
cask "arc"

# Utilities - CLI
brew "aria2"
brew "bat"
brew "direnv"
brew "eza"
brew "fd"
brew "fzf"
brew "glow"
brew "gnupg"
brew "htop"
brew "jira-cli"
brew "nmap"
brew "openssh"
brew "p7zip"
brew "ripgrep"
brew "timg"
brew "viddy"
brew "zoxide"
brew "lnav"
brew "parallel"
brew "rclone"
brew "grc"

# Utilities - GUI
cask "google-drive"
cask "openvpn-connect"
cask "macs-fan-control"

# Fonts
cask "font-iosevka"
cask "font-fontawesome"
cask "font-material-icons"
cask "font-hack-nerd-font"
cask "font-awesome-terminal-fonts"

# AI tools
cask "cursor"
cask "amazon-q"
cask "claude-code"

# Cloud - AWS
brew "awscli"
brew "aws-sam-cli"
brew "cfn-flip"
brew "cfn-lint"
brew "regula"
brew "granted"
brew "lucagrulla/tap/cw"

# Cloud - Terraform
brew "hashicorp/tap/terraform"
brew "hashicorp/tap/terraform-ls"
brew "serverless"

# Productivity
brew "jira-cli"
cask "spotify"
brew "spicetify-cli"
cask "signal"
cask "slack"
cask "zoom"

# Database
brew "pgcli"

# Web servers
brew "caddy"
brew "httpd"

# Other tools
brew "mike-engel/jwt-cli/jwt-cli", args: ["HEAD"]
brew "graphviz"

# Obsolete - keeping installed for now
brew "svn"
brew "subversion"
brew "the_silver_searcher"
brew "pipenv"
brew "rbenv"
cask "temurin8"
brew "ncspot"
brew "prettyping"
